{
  "books": [
    {
      "id": "5YVfWey",
      "title": "The Golden Compass",
      "author": "Philip Pullman",
      "description": "Lyra is rushing to the cold, far North, where witch clans and armored bears rule. North, where the Gobblers take the children they steal—including her friend Roger. North, where her fearsome uncle Asriel is trying to build a bridge to a parallel world.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1447970354l/6316671._SY475_.jpg",
      "genre": "Fantasy",
      "price": "52.25"
    },
    {
      "id": "wCkKA-i",
      "title": "The Girl on the Train",
      "author": "Paula Hawkins",
      "description": "Rachel catches the same commuter train every morning. She knows it will wait at the same signal each time, overlooking a row of back gardens. She’s even started to feel like she knows the people who live in one of the houses. “Jess and Jason,” she calls them. Their life—as she sees it—is perfect. If only Rachel could be that happy. And then she sees something shocking. It’s only a minute until the train moves on, but it’s enough. Now everything’s changed. Now Rachel has a chance to become a part of the lives she’s only watched from afar. Now they’ll see; she’s much more than just the girl on the train.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1413304106l/23364977.jpg",
      "genre": "Thriller",
      "price": "25.56"
    },
    {
      "id": "1uhu3NC",
      "title": "The Last Wish",
      "author": "Andrzej Sapkowski",
      "description": "Geralt is a Witcher, a man whose magic powers, enhanced by long training and a mysterious elixir,have made him a brilliant fighter and a merciless assassin. Yet he is no ordinary murderer: his targets are the multifarious monsters and vile fiends that ravage the land and attack the innocent.But not everything monstrous-looking is evil and not everything fair is good...and in every fairy tale there is a grain of truth.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1181224890l/1128434._SX318_.jpg",
      "genre": "Fantasy",
      "price": "77.7"
    },
    {
      "id": "IaDqMmy",
      "title": "The Hunger Games",
      "author": "Suzanne Collins",
      "description": "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV. Sixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she is forced to represent her district in the Games.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1586722975l/2767052.jpg",
      "genre": "Dystopian",
      "price": "95.99"
    },
    {
      "id": "3kDIJni",
      "title": "Pet Sematary",
      "author": "Stephen King",
      "description": "Creeds move into a beautiful old house in rural Maine, it all seems too good to be true: physician father, beautiful wife, charming little daughter, adorable infant son-and now an idyllic home. As a family, they've got it all...right down to the friendly car. But the nearby woods hide a blood-chilling truth-more terrifying than death itself and hideously more powerful. The Creeds are going to learn that sometimes dead is better.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1555968336l/45273781._SY475_.jpg",
      "genre": "Horror",
      "price": "89.5"
    },
    {
      "id": "ucuD90Y",
      "title": "The Da Vinci Code",
      "author": "Dan Brown",
      "description": "While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body covered in baffling symbols. As Langdon and gifted French cryptologist Sophie Neveu sort through the bizarre riddles, they are stunned to discover a trail of clues hidden in the works of Leonardo da Vinci—clues visible for all to see and yet ingeniously disguised by the painter.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1579621267l/968.jpg",
      "genre": "Mystery",
      "price": "60"
    },
    {
      "id": "YTPX5bw",
      "title": "Jurassic Park",
      "author": "Michael Crichton",
      "description": "An astonishing technique for recovering and cloning dinosaur DNA has been discovered. Now humankind’s most thrilling fantasies have come true. Creatures extinct for eons roam Jurassic Park with their awesome presence and profound mystery, and all the world can visit them—for a price.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1594232638l/7653482.jpg",
      "genre": "Science Fiction",
      "price": "25"
    },
    {
      "id": "hpS9Id-",
      "title": "Hidden Bodies",
      "author": "Caroline Kepnes",
      "description": "Joe Goldberg is no stranger to hiding bodies. In the past ten years, this thirty-something has buried four of them, collateral damage in his quest for love. Now he’s heading west to Los Angeles, the city of second chances, determined to put his past behind him.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1437414470l/23492288._SY475_.jpg",
      "genre": "Thriller",
      "price": "41.25"
    },
    {
      "id": "yfBWbVy",
      "title": "It",
      "author": "Stephen King",
      "description": "It’s a small city, a place as hauntingly familiar as your own hometown. Only in Derry the haunting is real ...They were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But none of them can withstand the force that has drawn them back to Derry to face the nightmare without an end, and the evil without a name.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1500804366l/34684623.jpg",
      "genre": "Horror",
      "price": "35.56",
      "liked": "false"
    }
  ],
  "genre": [
    "Dystopian",
    "Fantasy",
    "Horror",
    "Mystery",
    "Science Fiction",
    "Thriller"
  ],
  "favorites": [
    {
      "id": "5YVfWey",
      "title": "The Golden Compass",
      "author": "Philip Pullman",
      "description": "Lyra is rushing to the cold, far North, where witch clans and armored bears rule. North, where the Gobblers take the children they steal—including her friend Roger. North, where her fearsome uncle Asriel is trying to build a bridge to a parallel world.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1447970354l/6316671._SY475_.jpg",
      "genre": "Fantasy",
      "price": "52.25"
    },
    {
      "id": "yfBWbVy",
      "title": "It",
      "author": "Stephen King",
      "description": "It’s a small city, a place as hauntingly familiar as your own hometown. Only in Derry the haunting is real ...They were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But none of them can withstand the force that has drawn them back to Derry to face the nightmare without an end, and the evil without a name.",
      "imageUrl": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1500804366l/34684623.jpg",
      "genre": "Horror",
      "price": "35.56",
      "liked": "false"
    }
  ]
}